Revit 2026 API

# PrintParametersPaperSize Property

---

The page size.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public PaperSize PaperSize { get; set; }
```
```vb
Public Property PaperSize As PaperSize
	Get
	Set
```
```cpp
public:
property PaperSize^ PaperSize {
	PaperSize^ get ();
	void set (PaperSize^ value);
}
```
```fsharp
member PaperSize : PaperSize with get, set
```

#### Property Value

PaperSize

| Exception | Condition |
| --- | --- |
| ArgumentNullException | Thrown when the input argument is . |
| ArgumentException | Thrown when the input argument is invalid for current printer. |

User can select the candidate via PaperSizes and then set the Page source of the Print Setting.

#### Reference

PrintParameters Class

Autodesk.Revit.DB Namespace